/**
 * @file	Dx12SwapChain.cpp
 * @brief	スワップチェインクラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "Dx12SwapChain.h"


namespace Lib
{
	namespace Dx12
	{
		//----------------------------------------------------------------------
		// Constructor	Destructor
		//----------------------------------------------------------------------
		SwapChain::SwapChain()
		{
		}

		SwapChain::~SwapChain()
		{
		}
	}
}
