/**
 * @file	EnemyUI.cpp
 * @brief	エネミーUIクラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "EnemyUI.h"


namespace Game
{
	//----------------------------------------------------------------------
	// Constructor	Destructor
	//----------------------------------------------------------------------
	EnemyUI::EnemyUI()
	{
	}

	EnemyUI::~EnemyUI()
	{
	}


	//----------------------------------------------------------------------
	// Public Functions
	//----------------------------------------------------------------------
	bool EnemyUI::Initialize()
	{
		return true;
	}

	void EnemyUI::Finalize()
	{
	}

	void EnemyUI::Update()
	{
	}

	void EnemyUI::Draw()
	{
	}
}
