/**
 * @file	Dx11IVertex.cpp
 * @brief	頂点インターフェース実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "Dx11IVertex.h"


namespace Lib
{
	namespace Dx11
	{
		//----------------------------------------------------------------------
		// Constructor	Destructor
		//----------------------------------------------------------------------
		IVertex::IVertex()
		{
		}

		IVertex::~IVertex()
		{
		}
	}
}

