/**
 * @file	Dx11Billboard2D.cpp
 * @brief	2Dビルボード描画クラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "Dx11Billboard2D.h"


namespace Lib
{
	namespace Dx11
	{
		//----------------------------------------------------------------------
		// Constructor	Destructor
		//----------------------------------------------------------------------
		Billboard2D::Billboard2D()
		{
		}

		Billboard2D::~Billboard2D()
		{
		}
	}
}
