/**
 * @file	GameTimeUI.cpp
 * @brief	ゲームタイムUIクラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "GameTimeUI.h"


namespace Game
{
	//----------------------------------------------------------------------
	// Constructor	Destructor
	//----------------------------------------------------------------------
	TimeUI::TimeUI()
	{
	}

	TimeUI::~TimeUI()
	{
	}


	//----------------------------------------------------------------------
	// Public Functions
	//----------------------------------------------------------------------
	bool TimeUI::Initialize()
	{
		return true;
	}

	void TimeUI::Finalize()
	{
	}

	void TimeUI::Update()
	{
	}

	void TimeUI::Draw()
	{
	}
}
