/**
 * @file	Player.cpp
 * @brief	プレイヤークラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "Player.h"


namespace Game
{
	//----------------------------------------------------------------------
	// Constructor	Destructor
	//----------------------------------------------------------------------
	Player::Player()
	{
	}

	Player::~Player()
	{
	}


	//----------------------------------------------------------------------
	// Public Functions
	//----------------------------------------------------------------------
	bool Player::Initialize()
	{
		return true;
	}
	
	void Player::Finalize()
	{
	}

	void Player::Update()
	{
	}
	
	void Player::Draw()
	{
	}
}
